/*******************************************************************************
*   文  件 名：Process.c
*   功     能：封装进程功能
*   作     者：zhanxc
*   E-Mail   : zhanxc_chpu@sina.com
*   创建日期：018-7-17
*   修改历史：无
*******************************************************************************/

#include "Process.h"

/*******************************************************************************
*   函 数   名：CBLFork
*   功     能：fork一个新的进程，fork进程一般父进程优先执行，vfork确保子进程首先被执行
*             vfork不能直接return，如果封装成函数会出现问题。
*   输入参数：无
*   输出参数：无
*   返 回 值：-1:fork进程失败
*             0:返回到子进程
*             >0:返回到父进程
*   作     者：zhanxc
*   创建日期：018-7-17
*   修改历史：无
*******************************************************************************/
pid_t CBLFork(VOID)
{
    return fork();
}

/*******************************************************************************
*   函 数   名：CBLGetPid
*   功     能：得到进程的进程ID
*   输入参数：无
*   输出参数：无
*   返 回 值：进程ID号
*   作     者：zhanxc
*   创建日期：018-7-17
*   修改历史：无
*******************************************************************************/
pid_t CBLGetPid(VOID)
{
    return getpid();
}

/*******************************************************************************
*   函 数   名：CBLGetPPid
*   功     能：得到当前进程的父进程ID
*   输入参数：无
*   输出参数：无
*   返 回 值：当前进程的父进程ID号
*   作     者：zhanxc
*   创建日期：018-7-17
*   修改历史：无
*******************************************************************************/
pid_t CBLGetPPid(VOID)
{
    return getppid();
}

