/*******************************************************************************
*   文  件 名：Shmid.c
*   功     能：封装共享内存功能
*   作     者：zhanxc
*   E-Mail   : zhanxc_chpu@sina.com
*   创建日期：018-7-17
*   修改历史：无
*******************************************************************************/

#include "Shmid.h"

/*******************************************************************************
    共享内存就是允许两个不相关的进程访问同一个逻辑内存。共享内存是在两个正在运行
    的进程之间共享和传递数据的一种非常有效的方式。不同进程之间共享的内存通常安排
    为同一段物理内存。进程可以将同一段共享内存连接到它们自己的地址空间中，所有进
    程都可以
*******************************************************************************/

/*******************************************************************************
*   函 数   名：CreateShmid
*   功     能：得到一个共享内存标识符或创建一个共享内存对象并返回共享内存标识符
*   输入参数：iKey:0(IPC_PRIVATE):会建立新共享内存对象
*                  大于0的32位整数:视参数iFlag来确定操作。通常要求此值来源于ftok
*                       返回的IPC键值
*             iSize:大于0的整数:新建的共享内存大小，以字节为单位
*                   0:只获取共享内存时指定为0
*             iFlag:0:取共享内存标识符，若不存在则函数会报错
*                   IPC_CREAT:当iFlag&IPC_CREAT为真时，如果内核中不存在键值与iKey
*                       相等的共享内存，则新建一个共享内存；如果存在这样的共享内存，
*                       返回此共享内存的标识符
*                   IPC_CREAT|IPC_EXCL:如果内核中不存在键值与iKey相等的共享内存，则
*                       新建一个共享内存；如果存在这样的共享内存则报错
*   输出参数：无
*   返 回 值：成功:返回共享内存的表述符
*             出错:-1，错误原因存于error中
*   附加说明：上述iFlag参数为模式标志参数，使用时需要与IPC对象存取权限(如0600)进行|
*             运算来确定信号量集的存取权限
*   错 误 码：EINVAL:参数iSize小于SHMMIN或大于SHMMAX
*             EEXIST:预建立iKey所指的共享内存，但已经存在
*             EIDRM:参数iKey所指的共享内存已经删除
*             ENOSPC:超过了系统允许建立的共享内存的最大值(SHMALL)
*             ENOENT:参数iKey所指的共享内存不存在，而参数iFlag未设IPC_CREAT位
*             EACCES:没有权限
*             ENOMEM:核心内存不足
*   作     者：zhanxc
*   创建日期：018-7-18
*   修改历史：无
*******************************************************************************/
INT32 CreateShmid(key_t iKey, size_t iSize, INT32 iFlag)
{
	return shmget(iKey, iSize, iFlag);
}

/*******************************************************************************
*   函 数   名：GetShmidAt
*   功     能：把共享内存区对象映射到调用进程的地址空间
*             连接共享内存标识符为iShmid的共享内存，连接成功后把共享内存映射到调用
*             进程的地址空间，随后可像本地空间一样访问。
*   输入参数：iShmid:共享内存标识符
*             pvShmAddr:指定共享内存出现在进程内存地址的什么位置，直接指定为NULL让
*               内核自己决定一个合适的地址位置
*             iFlag:SHM_RDONLY:为只读模式，其他为读写模式
*   输出参数：无
*   返 回 值：成功:附加好的共享内存地址
*             出错:-1，错误原因存于error中
*   附加说明：fork后子进程继承已连接的共享内存地址。exec后该子进程与已连接的共享内存
*             地址自动脱离(detach)。进程结束后，已连接的共享内存地址会自动脱落(detach)
*   错 误 码：EACCES:无权限以指定方式连接共享内存
*             EINVAL:无效的参数iShmid或pvShmAddr
*             ENOMEM:核心内存不足
*   作     者：zhanxc
*   创建日期：018-7-18
*   修改历史：无
*******************************************************************************/
VOID *AtachShmid(INT32 iShmid, const VOID *pvShmAddr, INT32 iFlag)
{
	return shmat(iShmid, pvShmAddr, iFlag);
}

/*******************************************************************************
*   函 数   名：DelShmidDt
*   功     能：与shmat函数相反，是用来断开与共享内存附加点的地址，禁止本进程
*             访问此片共享内存
*   输入参数：pvShmAddr:连接的共享内存的起始地址
*   输出参数：无
*   返 回 值：成功:0
*             出错:-1，错误原因存于error中
*   附加说明：本函数调用并不删除所指定的共享内存区，而只是将先前用shmat函数
*             连接（attach）好的共享内存脱离（detach）目前的进程
*   错 误 码：EINVAL:无效的参数pvShmAddr
*   作     者：zhanxc
*   创建日期：018-7-18
*   修改历史：无
*******************************************************************************/
INT32 DetachShmid(const VOID *pvShmAddr)
{
	return shmdt(pvShmAddr);
}

/*******************************************************************************
*   函 数   名：ControlShmidCtl
*   功     能：完成对共享内存的控制
*   输入参数：iShmid:共享内存标识符
*             iCmd:IPC_STAT：得到共享内存的状态，把共享内存的shmid_ds结构复制到pstBuff中
*                  IPC_SET：改变共享内存的状态，把pstBuff所指的shmid_ds结构中的uid、gid、mode复制到共享内存的shmid_ds结构内
*                  IPC_RMID：删除这片共享内存
*             pstBuff:共享内存管理结构体。具体说明参见共享内存内核结构定义部分
*   输出参数：无
*   返 回 值：成功:0
*             出错:-1，错误原因存于error中
*   错 误 码：EACCES:参数iCmd为IPC_STAT，却无权限读取该共享内存
*             EFAULT:参数pstBuff指向无效的内存地址
*             EIDRM:标识符为iShmid的共享内存已被删除
*             EINVAL:无效的参数iCmd或iShmid
*             EPERM:参数iCmd为IPC_SET或IPC_RMID，却无足够的权限执行
*   作     者：zhanxc
*   创建日期：018-7-18
*   修改历史：无
*******************************************************************************/
INT32 ControlShmid(INT32 iShmid, INT32 iCmd, struct shmid_ds *pstBuff)
{
	return shmctl(iShmid, iCmd, pstBuff);
}

