/*******************************************************************************
*   文  件 名：Socket.c
*   功     能：封装Unix Socket IPC功能
*   作     者：zhanxc
*   E-Mail   : zhanxc_chpu@sina.com
*   创建日期：018-7-21
*   修改历史：无
*******************************************************************************/

#include "Socket.h"

/*******************************************************************************
*   函 数   名：CreateUnixSocket
*   功     能：创建Unix Socket
*   输入参数：pcFifoName:管道名
*             iMode:管道文件操作权限
*   输出参数：无
*   返 回 值：-1:创建管道失败
*             >0:创建成功
*   作     者：zhanxc
*   创建日期：018-7-18
*   修改历史：无
*******************************************************************************/
INT32 CreateUnixSocket()
{

	return 0;
}


